Config/DataProcessors/ФормированиеЗаявокНаПеререгистрациюБюджетныхОбязательств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ФормированиеЗаявокНаПеререгистрациюБюджетныхОбязательств</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаФормированияДокументов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТиповаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТиповыеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДоговорыИИныеОснованияОбязательств</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СформированныеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаявкаНаПеререгистрацию</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РегистрацияОбязательствИСведенийПоДоговорам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПереносыКПС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УстаревшийКПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НовыйКПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Config/InformationRegisters/ПланФинансированияОбязательств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПланФинансированияОбязательств</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВВалюте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВВалютеБезусловная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаИсполнено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаИсполненоБезусловно</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Обязательство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючАналитики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючАналитикиПФО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОКП</Name>
					<Comment>Код по общероссийскому классификатору продукции</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/СоответствиеКПСПриПереносеОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеКПСПриПереносеОстатков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НовыйКПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаЗамены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтарыйКПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/СрокиИсполненияИСуммыОбязательств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СрокиИсполненияИСуммыОбязательств</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютаРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВВалюте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвансПроцентом</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаАванса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КурсРасчетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КратностьРасчетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентПоЗайму</Name>
					<Comment>Установленный договором займа процент за пользьвание займом</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КазначейскоеСопровождение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьОплатаВИностраннойВалюте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплатаВРублях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидОбязательства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПринятыхОбязательств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганКазначейства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Казначейства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РегистрацияОбязательствИСведенийПоДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитыЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РеквизитыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Обязательство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/ВидыПринятыхОбязательств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыПринятыхОбязательств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПринятоеОбязательство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятоеОбязательствоУчетПредмета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаНаИзменениеОбязательства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаНаИзменениеОбязательстваУчетПредмета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаНаПеререгистрациюОбязательства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаНаПеререгистрациюОбязательстваУчетПредмета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринимаемоеОбязательство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятоеОбязательствоКонкурсныеПроцедуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказОтДоговораКонкурсныеПроцедуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринимаемоеОбязательствоИзменения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринимаемоеОбязательствоПеререгистрация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/ОтветственныеЛицаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ОтветственныеЛицаОрганизаций</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Руководитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кассир</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РуководительПФС</Name>
					<Comment>Руководитель планово-финансовой службы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственныйИсполнительКадры</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/DataProcessors/ФормированиеЗаявокНаПеререгистрациюБюджетныхОбязательств/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Организация = ЗаполнениеРеквизитовОбъектов.ОрганизацияПоУмолчанию();
	Объект.ТиповаяОперация = Справочники.ТиповыеОперации.РегистрацияОбязательствИСведенийПоДоговорам_РегистрацияОбязательств;
	УстановитьВидимостьПереносаКПС();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Объект.ДатаФормированияДокументов = НачалоГода(ТекущаяДата());
	УстановитьДоступностьДоговоров();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	УстановитьВидимостьПереносаКПС();
	УстановитьДоступностьДоговоров();
	Объект.ДоговорыИИныеОснованияОбязательств.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ТиповаяОперацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДокументОснование", ПредопределенноеЗначение("Документ.РегистрацияОбязательствИСведенийПоДоговорам.ПустаяСсылка"));
	ОткрытьФорму("Справочник.ТиповыеОперации.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПереносыКПС

&НаКлиенте
Процедура ПереносыКПСНовыйКПСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ФормаВыбора = ПолучитьФорму("Справочник.КлассификационныеПризнакиСчетов.ФормаВыбора",, Элемент);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ФормаВыбора.Список.Отбор, "ДатаНачалаДействия", НачалоГода(Объект.ДатаФормированияДокументов), ВидСравненияКомпоновкиДанных.БольшеИлиРавно, ,Истина);
	ФормаВыбора.Открыть();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСформированныеДокументы

&НаКлиенте
Процедура СформированныеДокументыЗаявкаНаПеререгистрациюНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	 СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СформированныеДокументыЗаявкаНаПеререгистрациюНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СформированныеДокументыЗаявкаНаПеререгистрациюОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СформированныеДокументыЗаявкаНаПеререгистрациюИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СформированныеДокументыЗаявкаНаПеререгистрациюАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СформированныеДокументыЗаявкаНаПеререгистрациюОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьДоговора(Команда)
	
	Ответ = КодВозвратаДиалога.Нет;
	
	Если ПроверитьЗаполнение() Тогда
		
		Если Объект.ДоговорыИИныеОснованияОбязательств.Количество() > 0 Тогда
			ТекстВопроса = НСтр("ru = 'Внимание! Будет очищен список договоров и иных оснований возникновений обязательств.
								           |Продолжить?'");
			ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьДоговораЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
            Возврат; 
		Иначе
			Ответ = КодВозвратаДиалога.Да;
		КонецЕсли; 
		
		ЗаполнитьДоговораЗавершение(Ответ, Неопределено);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДокументы(Команда)
	
	Ответ = КодВозвратаДиалога.Нет;
	
	Если ПроверитьЗаполнение() Тогда
		
		Если Объект.ДоговорыИИныеОснованияОбязательств.Количество() = 0 Тогда
			
			ТекстВопроса = НСтр("ru = 'Требуется заполнить список договоров и иных оснований возникновений обязательств.
											  |Продолжить?'");
			ПоказатьВопрос(Новый ОписаниеОповещения("СформироватьДокументыЗавершение", ЭтотОбъект, Истина), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
            Возврат; 
			
		Иначе
			
			Ответ = КодВозвратаДиалога.Да;
			
		КонецЕсли; 
		
		СформироватьДокументыЗавершение(Ответ, Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеПоКПС(Команда)
	
	Ответ = КодВозвратаДиалога.Нет;
	
	Если ПроверитьЗаполнение() Тогда
		
		Если Объект.ПереносыКПС.Количество() > 0 Тогда
			ТекстВопроса = НСтр("ru = 'Внимание! Будет очищен список КПС.
								           |Продолжить?'");
			ПоказатьВопрос(Новый ОписаниеОповещения("ОбновитьДанныеПоКПСЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
            Возврат; 
		Иначе
			Ответ = КодВозвратаДиалога.Да;
		КонецЕсли; 
		
		ОбновитьДанныеПоКПСФрагмент(Ответ);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьДоступностьДоговоров()

	Элементы.ДоговорыИИныеОснованияОбязательств.Доступность = ЗначениеЗаполнено(Объект.Организация);	

КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьПереносыКПС()
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПФОСрезПоследних.КлючАналитики.КПС КАК УстаревшийКПС
	|ИЗ
	|	РегистрСведений.ПланФинансированияОбязательств.СрезПоследних(&Период, Обязательство.Организация = &Организация) КАК ПФОСрезПоследних
	|ГДЕ
	|	ПФОСрезПоследних.Сумма <> 0
	|	И ПФОСрезПоследних.КлючАналитики.ПериодПлана.ДатаНачала >= &Период
	|	И ПФОСрезПоследних.КлючАналитики.КПС.ДатаОкончанияДействия <= &Период";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Период", НачалоГода(Объект.ДатаФормированияДокументов) - 1);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	Объект.ПереносыКПС.Загрузить(Запрос.Выполнить().Выгрузить());
	
	// Заполнение новых КПС по данным регистра "СоответствиеКПСПриПереносеОстатков"
	СтарыеКПС = Новый Соответствие;
	Для Каждого Перенос Из Объект.ПереносыКПС Цикл
		СтарыеКПС.Вставить(Перенос.УстаревшийКПС);
	КонецЦикла;
	
	СоответствиеКПС = РегистрыСведений.СоответствиеКПСПриПереносеОстатков.СоответствиеКПС(СтарыеКПС, НачалоГода(Объект.ДатаФормированияДокументов));
	
	Для Каждого Перенос Из Объект.ПереносыКПС Цикл
		Если СоответствиеКПС[Перенос.УстаревшийКПС] <> Неопределено Тогда
			Перенос.НовыйКПС = СоответствиеКПС[Перенос.УстаревшийКПС];
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДокументыСервер()
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	|	ТаблицаКПС.УстаревшийКПС КАК УстаревшийКПС,
	|	ТаблицаКПС.НовыйКПС КАК НовыйКПС
	|ПОМЕСТИТЬ ТаблицаКПС
	|ИЗ
	|	&ТаблицаКПС КАК ТаблицаКПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДоговоров.Договор КАК Договор
	|ПОМЕСТИТЬ ТаблицаДоговоров
	|ИЗ
	|	&ТаблицаДоговоров КАК ТаблицаДоговоров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Договоры.Договор КАК ДоговорОснованиеОбязательства,
	|	ВЫРАЗИТЬ(Договоры.Договор КАК Справочник.Договоры).ПометкаУдаления КАК ПометкаУдаления,
	|	ВЫРАЗИТЬ(Договоры.Договор КАК Справочник.Договоры).Долгосрочный КАК Долгосрочный,
	|	ВЫРАЗИТЬ(Договоры.Договор КАК Справочник.Договоры).УчетПредметаДоговора КАК УчетПредметаДоговора,
	|	ВЫРАЗИТЬ(Договоры.Договор КАК Справочник.Договоры).Организация КАК Организация,
	|	ВЫРАЗИТЬ(Договоры.Договор КАК Справочник.Договоры).Контрагент КАК Контрагент,
	|	ВЫРАЗИТЬ(Договоры.Договор КАК Справочник.Договоры).СчетКонтрагента КАК СчетКонтрагента,
	|	ВЫРАЗИТЬ(Договоры.Договор КАК Справочник.Договоры).ЗаключаетсяПоРезультатамКонкурсныхПроцедур КАК ЗаключаетсяПоРезультатамКонкурсныхПроцедур,
	|	ВЫРАЗИТЬ(Договоры.Договор КАК Справочник.Договоры).ПризнакЗавершенияКонкурсныхПроцедур КАК ПризнакЗавершенияКонкурсныхПроцедур
	|ПОМЕСТИТЬ СписокДоговоров
	|ИЗ
	|	ТаблицаДоговоров КАК Договоры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокДоговоров.ДоговорОснованиеОбязательства КАК ДоговорОснованиеОбязательства,
	|	СписокДоговоров.ПометкаУдаления КАК ПометкаУдаления,
	|	СписокДоговоров.Долгосрочный КАК Долгосрочный,
	|	СписокДоговоров.УчетПредметаДоговора КАК УчетПредметаДоговора,
	|	ВЫБОР
	|		КОГДА СписокДоговоров.ЗаключаетсяПоРезультатамКонкурсныхПроцедур
	|				И НЕ СписокДоговоров.ПризнакЗавершенияКонкурсныхПроцедур
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ПринимаемоеОбязательствоПеререгистрация)
	|		КОГДА СписокДоговоров.УчетПредметаДоговора
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ЗаявкаНаПеререгистрациюОбязательстваУчетПредмета)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ЗаявкаНаПеререгистрациюОбязательства)
	|	КОНЕЦ КАК ВидОбязательства,
	|	СписокДоговоров.Организация КАК Организация,
	|	СписокДоговоров.Контрагент КАК Контрагент,
	|	СписокДоговоров.СчетКонтрагента КАК СчетКонтрагента,
	|	СрокиИсполненияИСуммыОбязательствСрезПоследних.ИФО КАК ИФО,
	|	СрокиИсполненияИСуммыОбязательствСрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	СрокиИсполненияИСуммыОбязательствСрезПоследних.ОрганКазначейства КАК ОрганКазначейства,
	|	СрокиИсполненияИСуммыОбязательствСрезПоследних.РеквизитыЛицевогоСчета КАК РеквизитыЛицевогоСчета,
	|	СрокиИсполненияИСуммыОбязательствСрезПоследних.Регистратор КАК Основание,
	|	СрокиИсполненияИСуммыОбязательствСрезПоследних.ВалютаРасчетов КАК Валюта,
	|	СрокиИсполненияИСуммыОбязательствСрезПоследних.СрокИсполнения КАК СрокИсполнения,
	|	СрокиИсполненияИСуммыОбязательствСрезПоследних.НачалоДействия КАК НачалоДействия,
	|	СрокиИсполненияИСуммыОбязательствСрезПоследних.ОкончаниеДействия КАК ОкончаниеДействия,
	|	СрокиИсполненияИСуммыОбязательствСрезПоследних.АвансПроцентом КАК АвансПроцентом,
	|	СрокиИсполненияИСуммыОбязательствСрезПоследних.СуммаАванса КАК СуммаАванса,
	|	СрокиИсполненияИСуммыОбязательствСрезПоследних.ПроцентПоЗайму КАК ПроцентПоЗайму,
	|	СрокиИсполненияИСуммыОбязательствСрезПоследних.КазначейскоеСопровождение КАК КазначейскоеСопровождение,
	|	СрокиИсполненияИСуммыОбязательствСрезПоследних.ОплатаВРублях КАК ОплатаВРублях,
	|	СрокиИсполненияИСуммыОбязательствСрезПоследних.Сумма КАК Сумма,
	|	СрокиИсполненияИСуммыОбязательствСрезПоследних.СуммаВВалюте КАК СуммаВВалюте
	|ИЗ
	|	СписокДоговоров КАК СписокДоговоров
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СрокиИсполненияИСуммыОбязательств.СрезПоследних(
	|				&Период,
	|				Обязательство В
	|					(ВЫБРАТЬ
	|						СписокДоговоров.ДоговорОснованиеОбязательства
	|					ИЗ
	|						СписокДоговоров КАК СписокДоговоров)) КАК СрокиИсполненияИСуммыОбязательствСрезПоследних
	|		ПО СписокДоговоров.ДоговорОснованиеОбязательства = СрокиИсполненияИСуммыОбязательствСрезПоследних.Обязательство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПФОСрезПоследних.Обязательство КАК Обязательство,
	|	ПФОСрезПоследних.КлючАналитики.КФО КАК КФО,
	|	ПФОСрезПоследних.КлючАналитики.КПС КАК КПС,
	|	ПФОСрезПоследних.КлючАналитики.КЭК КАК КЭК,
	|	ПФОСрезПоследних.КлючАналитики.ОбъектФАИП КАК ОбъектФАИП,
	|	ПФОСрезПоследних.КлючАналитики.Номенклатура КАК Номенклатура,
	|	ПФОСрезПоследних.КлючАналитики.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ПФОСрезПоследних.КлючАналитики.ПериодПлана КАК ПериодПлана,
	|	ПФОСрезПоследних.КлючАналитики.РазделЛицевогоСчета КАК РазделЛицевогоСчета,
	|	ПФОСрезПоследних.КлючАналитики.КодЦели КАК КодЦели,
	|	ПФОСрезПоследних.КлючАналитики.КодМероприятия КАК КодМероприятия,
	|	ПФОСрезПоследних.КлючАналитики.ДопКлассификация КАК ДопКлассификация,
	|	ПФОСрезПоследних.КлючАналитики.Подразделение КАК Подразделение,
	|	ПФОСрезПоследних.ОКП КАК ОКП,
	|	ПФОСрезПоследних.Количество КАК Количество,
	|	ПФОСрезПоследних.Сумма КАК Сумма,
	|	ПФОСрезПоследних.СуммаВВалюте КАК СуммаВВалюте,
	|	ПФОСрезПоследних.СуммаВВалютеБезусловная КАК СуммаВВалютеБезусловная,
	|	ИСТИНА КАК ЗапретИзменения,
	|	ВЫБОР
	|		КОГДА ТаблицаКПС.НовыйКПС ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ТребуетсяСторнировать,
	|	ВЫБОР
	|		КОГДА ПФОСрезПоследних.КлючАналитики.КЭК В ИЕРАРХИИ (&КОСГУ340)
	|				И НЕ ПФОСрезПоследних.КлючАналитики.КЭК = &КОСГУ340
	|				И ГОД(&Период) = 2025
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТребуетсяНовыйКЭК,
	|	ВЫБОР
	|		КОГДА ТаблицаКПС.НовыйКПС ЕСТЬ NULL
	|			ТОГДА ПФОСрезПоследних.КлючАналитики.КПС
	|		ИНАЧЕ ТаблицаКПС.НовыйКПС
	|	КОНЕЦ КАК НовыйКПС,
	|	ВЫБОР
	|		КОГДА ПФОСрезПоследних.КлючАналитики.КЭК В ИЕРАРХИИ (&КОСГУ340)
	|				И НЕ ПФОСрезПоследних.КлючАналитики.КЭК = &КОСГУ340
	|				И ГОД(&Период) = 2025
	|			ТОГДА &КОСГУ340
	|		ИНАЧЕ ПФОСрезПоследних.КлючАналитики.КЭК
	|	КОНЕЦ КАК НовыйКЭК
	|ИЗ
	|	РегистрСведений.ПланФинансированияОбязательств.СрезПоследних(
	|			&Период,
	|			обязательство В
	|				(ВЫБРАТЬ
	|					СписокДоговоров.ДоговорОснованиеОбязательства
	|				ИЗ
	|					СписокДоговоров КАК СписокДоговоров)) КАК ПФОСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаКПС КАК ТаблицаКПС
	|		ПО ПФОСрезПоследних.КлючАналитики.КПС = ТаблицаКПС.УстаревшийКПС
	|ГДЕ
	|	ПФОСрезПоследних.Сумма <> 0";

	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Период", НачалоГода(Объект.ДатаФормированияДокументов) - 1); 
	Запрос.УстановитьПараметр("ТаблицаДоговоров", Объект.ДоговорыИИныеОснованияОбязательств.Выгрузить());
	Запрос.УстановитьПараметр("ТаблицаКПС", Объект.ПереносыКПС.Выгрузить()); 
	Запрос.УстановитьПараметр("КОСГУ340", Справочники.КОСГУ.НайтиПоКоду("340"));
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	// МассивРезультатов[0] - таблица КПС
	// МассивРезультатов[1] - таблица договоров
	// МассивРезультатов[2] - список договоров
	ВыборкаРеквизитов = МассивРезультатов[3].Выбрать();
	ТаблицаПФО = МассивРезультатов[4].Выгрузить();
	
	СтруктураПоиска = Новый Структура("Обязательство");
	БюджетВнебюджетПоКФО = РаботаСОбязательствамиПовтИсп.ПолучитьБюджетВнебюджетПоКФО();	
	
	Пока ВыборкаРеквизитов.Следующий() Цикл
		
		НовыйДокумент = Документы.РегистрацияОбязательствИСведенийПоДоговорам.СоздатьДокумент();
		НовыйДокумент.Дата = Объект.ДатаФормированияДокументов;
		
		НовыйДокумент.ВидОбязательства = ВыборкаРеквизитов.ВидОбязательства;
		
		НовыйДокумент.Основание 				= ВыборкаРеквизитов.Основание;
		НовыйДокумент.ИФО 						= ВыборкаРеквизитов.ИФО;
		НовыйДокумент.ЛицевойСчет 				= ВыборкаРеквизитов.ЛицевойСчет;
		НовыйДокумент.СчетКонтрагента 			= ВыборкаРеквизитов.СчетКонтрагента;
		НовыйДокумент.ОрганКазначейства 		= ВыборкаРеквизитов.ОрганКазначейства;
		НовыйДокумент.РеквизитыЛицевогоСчета	= ВыборкаРеквизитов.РеквизитыЛицевогоСчета;
		
		НовыйДокумент.Организация 				= ВыборкаРеквизитов.Организация;
		НовыйДокумент.Контрагент 				= ВыборкаРеквизитов.Контрагент;
		НовыйДокумент.Договор 					= ВыборкаРеквизитов.ДоговорОснованиеОбязательства;
		
		НовыйДокумент.ВалютаДокумента 			= ВыборкаРеквизитов.Валюта;
		СтруктураКурсаВалюты 					= РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВыборкаРеквизитов.Валюта, Объект.ДатаФормированияДокументов); 
		НовыйДокумент.Курс 						= СтруктураКурсаВалюты.Курс;
		НовыйДокумент.Кратность 				= СтруктураКурсаВалюты.Кратность;
		
		НовыйДокумент.СрокИсполнения 			= ВыборкаРеквизитов.СрокИсполнения;
		НовыйДокумент.АвансПроцентом 			= ВыборкаРеквизитов.АвансПроцентом;
		НовыйДокумент.СуммаАванса 				= ВыборкаРеквизитов.СуммаАванса;   
		
		НовыйДокумент.НачалоДействия			= ВыборкаРеквизитов.НачалоДействия;  
		НовыйДокумент.ОкончаниеДействия			= ВыборкаРеквизитов.ОкончаниеДействия;   
		НовыйДокумент.ПроцентПоЗайму			= ВыборкаРеквизитов.ПроцентПоЗайму;
		НовыйДокумент.ОплатаВРублях				= ВыборкаРеквизитов.ОплатаВРублях;
		НовыйДокумент.КазначейскоеСопровождение	= ВыборкаРеквизитов.КазначейскоеСопровождение; 
		
		НовыйДокумент.Сумма						= ВыборкаРеквизитов.Сумма;
        НовыйДокумент.СуммаВВалюте				= ВыборкаРеквизитов.СуммаВВалюте;
		
		НовыйДокумент.Руководитель 				= ОрганизационнаяСтруктураПовтИсп.ОтветственноеЛицоОрганизации(Объект.Организация, Перечисления.ОтветственныеЛицаОрганизаций.Руководитель, НовыйДокумент.Дата).ОтветственноеЛицоСсылка; 
		НовыйДокумент.ПечататьДолжность 		= НЕ НовыйДокумент.Руководитель.Пустая();  
		
		Если ТипЗнч(ВыборкаРеквизитов.Основание) = Тип("ДокументСсылка.РегистрацияОбязательствИСведенийПоДоговорам") Тогда
			НовыйДокумент.Контрагенты.Загрузить(ВыборкаРеквизитов.Основание.Контрагенты.Выгрузить()); 
		КонецЕсли;
		
		// Заполнение ТЧ документа
		СтруктураПоиска.Обязательство = ВыборкаРеквизитов.ДоговорОснованиеОбязательства;
		МассивСтрок = ТаблицаПФО.НайтиСтроки(СтруктураПоиска);
		Для каждого СтрокаПФО Из МассивСтрок Цикл
			
			ИмяТЧ = БюджетВнебюджетПоКФО[СтрокаПФО.КФО];
			Если НЕ ПустаяСтрока(ИмяТЧ) Тогда
				
				ИмяТЧ = "РасшифровкаОбязательства" + ИмяТЧ;
				НоваяСтрока = НовыйДокумент[ИмяТЧ].Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПФО);
								
				Если СтрокаПФО.ТребуетсяСторнировать ИЛИ СтрокаПФО.ТребуетсяНовыйКЭК Тогда
					
					СтрокаСторно = НовыйДокумент[ИмяТЧ].Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаСторно, НоваяСтрока);
					СтрокаСторно.КПС = СтрокаПФО.НовыйКПС; 
					СтрокаСторно.КЭК = СтрокаПФО.НовыйКЭК;
					СтрокаСторно.ЗапретИзменения = Истина;
					
					НоваяСтрока.Количество = 0;
					НоваяСтрока.Сумма = 0;
					НоваяСтрока.СуммаВВалюте = 0;
					
				КонецЕсли; 
			КонецЕсли; 
		КонецЦикла;
			
		НовыйДокумент.Комментарий = "#Создан автоматически";
		
		ДополнительныеРеквизиты = Новый Структура();
		БухгалтерскиеОперацииСервер.ДобавитьДанныеДляПроведения(НовыйДокумент, Объект.ТиповаяОперация, ДополнительныеРеквизиты);
		
		Если ТекущаяДата() < Объект.ДатаФормированияДокументов Тогда
			
			НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);		
			
		Иначе
			
			Попытка
				НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			Исключение
				НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);	
			КонецПопытки;
			
		КонецЕсли;
		
		НоваяСтрокаДокумента = Объект.СформированныеДокументы.Добавить();
		НоваяСтрокаДокумента.ЗаявкаНаПеререгистрацию = НовыйДокумент.Ссылка;
		
	КонецЦикла; 
	
	Элементы.Организация.ТолькоПросмотр = Истина;
		
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПереносаКПС()
	
	ВидимостьПереноса = Ложь; 
	
	Если Объект.Организация.Пустая()  Тогда
		
		ВидимостьПереноса = Ложь;
		
	Иначе
		
		УчетнаяПолитика = Справочники.Организации.ПолучитьУчетнуюПолитику(Объект.Организация);
		ВидимостьПереноса = НЕ (УчетнаяПолитика.СтруктураРПС = Справочники.СтруктурыРПС.ДляАвтономных);
		
	КонецЕсли; 	
	
	Элементы.ГруппаПереносыКПС.Видимость = ВидимостьПереноса;
	
КонецПроцедуры

&НаСервере
функция ПроверитьДублиКПС()
	
	Результат = Ложь;
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ПереносыКПС.НомерСтроки,
	               |	ПереносыКПС.УстаревшийКПС
	               |ПОМЕСТИТЬ ПереносыКПС
	               |ИЗ
	               |	&ПереносыКПС КАК ПереносыКПС
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(ПереносыКПС.НомерСтроки) КАК НомерСтроки,
	               |	ПереносыКПС.УстаревшийКПС
	               |ИЗ
	               |	ПереносыКПС КАК ПереносыКПС
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПереносыКПС.УстаревшийКПС
	               |
	               |ИМЕЮЩИЕ
	               |	КОЛИЧЕСТВО(*) > 1";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ПереносыКПС", Объект.ПереносыКПС.Выгрузить());
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Результат = Истина;
		ТекстОшибки = НСтр("ru = 'Обнаружен дубль устаревшего КПС в строке списка'");	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, "ПереносыКПС[" + (Выборка.НомерСтроки - 1) + "].УстаревшийКПС", "Объект");
		
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьДоговораЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Если РезультатВопроса = КодВозвратаДиалога.Да Тогда  
		
		ФоновоеЗадание = ЗаполнитьДоговораВФоне(ДополнительныеПараметры);  
		НастройкиОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		НастройкиОжидания.ВыводитьОкноОжидания = Истина;
		Обработчик = Новый ОписаниеОповещения("ЗаполнитьДоговораКлиент", ЭтотОбъект, ДополнительныеПараметры);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ФоновоеЗадание, Обработчик, НастройкиОжидания);

    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДоговораКлиент(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Результат.Статус <> "Выполнено" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	ЗаполнитьДоговораСервер(Результат, ДополнительныеПараметры);
	
КонецПроцедуры    

&НаСервере
Процедура ЗаполнитьДоговораСервер(Результат, ДополнительныеПараметры) 
	
	ТабДоговоры = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	
	Объект.ДоговорыИИныеОснованияОбязательств.Загрузить(ТабДоговоры);
	
	Если ДополнительныеПараметры = Истина Тогда
		ЗаполнитьПереносыКПС();
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция ЗаполнитьДоговораВФоне(ВыполнитьФормированиеДокументов)
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ДатаФормированияДокументов", Объект.ДатаФормированияДокументов);
	ПараметрыПроцедуры.Вставить("Организация", Объект.Организация); 
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(ЭтотОбъект.УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Заполнение договоров на сервере.'");
	
	ФоновоеЗадание = ДлительныеОперации.ВыполнитьВФоне(
		"Обработки.ФормированиеЗаявокНаПеререгистрациюБюджетныхОбязательств.ЗаполнитьДоговораСервер",
		ПараметрыПроцедуры,
		ПараметрыВыполнения);
	
	Возврат ФоновоеЗадание;
	
КонецФункции	

&НаКлиенте
Процедура СформироватьДокументыЗавершение(РезультатВопроса, ЗаполнитьДоговоры) Экспорт
	
	Перем ЕстьДублиКПС;
	
	Ответ = РезультатВопроса; 
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Если ЗаполнитьДоговоры Тогда
			ЗаполнитьДоговораЗавершение(КодВозвратаДиалога.Да, ЗаполнитьДоговоры);
		КонецЕсли;
		
		ЕстьДублиКПС = ПроверитьДублиКПС();
		
		Если ЕстьДублиКПС Тогда
			
		Иначе
			
			Объект.СформированныеДокументы.Очистить();
			
			СформироватьДокументыСервер();
			
			ТекущийЭлемент = Элементы.ГруппаСформированныеДокументы;
			
			ОповеститьОбИзменении(Тип("ДокументСсылка.РегистрацияОбязательствИСведенийПоДоговорам"));
			
		КонецЕсли; 	
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеПоКПСЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Ответ = РезультатВопроса; 
    
    ОбновитьДанныеПоКПСФрагмент(Ответ);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеПоКПСФрагмент(Знач Ответ)
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаполнитьПереносыКПС();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
